benchmark/reports/20260607-004218/raw/k6.log
Unable to find image 'grafana/k6:latest' locally
latest: Pulling from grafana/k6
d17f077ada11: Already exists
189a4c2ff99e: Pulling fs layer
18cab65b2591: Pulling fs layer
4f4fb700ef54: Pulling fs layer
189a4c2ff99e: Download complete
4f4fb700ef54: Verifying Checksum
4f4fb700ef54: Download complete
189a4c2ff99e: Pull complete
18cab65b2591: Verifying Checksum
18cab65b2591: Download complete
18cab65b2591: Pull complete
4f4fb700ef54: Pull complete
Digest: sha256:632ddbc81a4a9fdc9e597da91ab1d8fcf1916dd988b43b4a4559d2f8d8e73d47
Status: Downloaded newer image for grafana/k6:latest

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/smap_api_smoke.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m15s max duration (incl. graceful stop):
              * default: 10 looping VUs for 45s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  01.0s/45s

running (0m02.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  02.0s/45s

running (0m03.0s), 10/10 VUs, 9 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  03.0s/45s

running (0m04.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  04.0s/45s

running (0m05.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  11% ] 10 VUs  05.0s/45s

running (0m06.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  06.0s/45s

running (0m07.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  07.0s/45s

running (0m08.0s), 10/10 VUs, 21 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  08.0s/45s

running (0m09.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  09.0s/45s

running (0m10.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  10.0s/45s

running (0m11.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  24% ] 10 VUs  11.0s/45s

running (0m12.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  12.0s/45s

running (0m13.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  29% ] 10 VUs  13.0s/45s

running (0m14.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  31% ] 10 VUs  14.0s/45s

running (0m15.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  15.0s/45s

running (0m16.0s), 10/10 VUs, 57 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  16.0s/45s

running (0m17.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  17.0s/45s

running (0m18.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  18.0s/45s

running (0m19.0s), 10/10 VUs, 69 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  19.0s/45s

running (0m20.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  44% ] 10 VUs  20.0s/45s

running (0m21.0s), 10/10 VUs, 71 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  21.0s/45s

running (0m22.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  49% ] 10 VUs  22.0s/45s

running (0m23.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  51% ] 10 VUs  23.0s/45s

running (0m24.0s), 10/10 VUs, 84 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  24.0s/45s

running (0m25.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  25.0s/45s

running (0m26.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  26.0s/45s

running (0m27.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  27.0s/45s

running (0m28.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  28.0s/45s

running (0m29.0s), 10/10 VUs, 101 complete and 0 interrupted iterations
default   [  64% ] 10 VUs  29.0s/45s

running (0m30.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  30.0s/45s

running (0m31.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [  69% ] 10 VUs  31.0s/45s

running (0m32.0s), 10/10 VUs, 114 complete and 0 interrupted iterations
default   [  71% ] 10 VUs  32.0s/45s

running (0m33.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  33.0s/45s

running (0m34.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  34.0s/45s

running (0m35.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  35.0s/45s

running (0m36.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  36.0s/45s

running (0m37.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  37.0s/45s

running (0m38.0s), 10/10 VUs, 135 complete and 0 interrupted iterations
default   [  84% ] 10 VUs  38.0s/45s

running (0m39.0s), 10/10 VUs, 140 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  39.0s/45s

running (0m40.0s), 10/10 VUs, 140 complete and 0 interrupted iterations
default   [  89% ] 10 VUs  40.0s/45s

running (0m41.0s), 10/10 VUs, 145 complete and 0 interrupted iterations
default   [  91% ] 10 VUs  41.0s/45s

running (0m42.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  42.0s/45s

running (0m43.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  43.0s/45s

running (0m44.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  44.0s/45s

running (0m45.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  45s

running (0m46.0s), 05/10 VUs, 165 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  45s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<2500' p(95)=149.84ms

    http_req_failed
    ✗ 'rate<0.01' rate=20.58%


  █ TOTAL RESULTS 

    checks_total.......: 3400   73.43566/s
    checks_succeeded...: 89.70% 3050 out of 3400
    checks_failed......: 10.29% 350 out of 3400

    ✓ health status 200
    ✓ health json-ish
    ✗ analytics_kpis status 200
      ↳  0% — ✓ 0 / ✗ 170
    ✓ analytics_kpis json-ish
    ✗ analytics_platforms status 200
      ↳  96% — ✓ 164 / ✗ 6
    ✓ analytics_platforms json-ish
    ✗ analytics_sentiment status 200
      ↳  98% — ✓ 168 / ✗ 2
    ✓ analytics_sentiment json-ish
    ✗ analytics_keywords status 200
      ↳  99% — ✓ 169 / ✗ 1
    ✓ analytics_keywords json-ish
    ✓ posts_latest status 200
    ✓ posts_latest json-ish
    ✓ posts_engagement status 200
    ✓ posts_engagement json-ish
    ✓ posts_page_2 status 200
    ✓ posts_page_2 json-ish
    ✗ project_stats status 200
      ↳  99% — ✓ 169 / ✗ 1
    ✓ project_stats json-ish
    ✗ heap_chart status 200
      ↳  0% — ✓ 0 / ✗ 170
    ✓ heap_chart json-ish

    HTTP
    http_req_duration..............: avg=68.34ms min=7.31ms med=47.29ms max=1.17s p(90)=117.52ms p(95)=149.84ms
      { expected_response:true }...: avg=69.84ms min=7.31ms med=50.85ms max=1.17s p(90)=116.68ms p(95)=148.56ms
    http_req_failed................: 20.58% 350 out of 1700
    http_reqs......................: 1700   36.71783/s

    EXECUTION
    iteration_duration.............: avg=2.7s    min=2.34s  med=2.62s   max=3.66s p(90)=2.9s     p(95)=3.26s   
    iterations.....................: 170    3.671783/s
    vus............................: 5      min=5           max=10
    vus_max........................: 10     min=10          max=10

    NETWORK
    data_received..................: 9.8 MB 213 kB/s
    data_sent......................: 123 kB 2.7 kB/s



running (0m46.3s), 00/10 VUs, 170 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  45s
time="2026-06-06T17:43:37Z" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"